In [13]:
import pandas as pd
df = pd.DataFrame({
    'company_code': ['Ab cd','EFGF ',' fhygy','abcd',' '],
    'date_of_sale ': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]})

In [14]:
df

  company_code date_of_sale   sale_amount
0        Ab cd    12/05/2002      12348.5
1        EFGF     16/02/1999     233331.2
2        fhygy    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4                 15/09/1997         23.0

In [16]:
startswith = df.company_code.str.startswith(' ')
startswith

0    False
1    False
2     True
3    False
4     True
Name: company_code, dtype: bool

In [17]:
endswith = df.company_code.str.endswith(' ')
endswith

0    False
1     True
2    False
3    False
4     True
Name: company_code, dtype: bool

In [8]:
# remove white spaces
df['company_code'] = df.company_code.str.replace(' ','')

In [9]:
df

  company_code date_of_sale   sale_amount
0         Abcd    12/05/2002      12348.5
1         EFGF    16/02/1999     233331.2
2        fhygy    25/09/1998         22.5
3         abcd    12/02/2022    2566552.0
4                 15/09/1997         23.0

In [22]:
df['company_code_is_title'] = list(map(lambda x: x.endswith(' '), df['company_code']))
df

  company_code date_of_sale   sale_amount  company_code_is_title
0        Ab cd    12/05/2002      12348.5                  False
1        EFGF     16/02/1999     233331.2                   True
2        fhygy    25/09/1998         22.5                  False
3         abcd    12/02/2022    2566552.0                  False
4                 15/09/1997         23.0                   True